
-- --------------------------------------------------------

--
-- Structură tabel pentru tabel `chat_reactions`
--

CREATE TABLE `chat_reactions` (
  `message_id` int NOT NULL,
  `user_id` int NOT NULL,
  `emoji` varchar(16) COLLATE utf8mb4_unicode_ci NOT NULL,
  `ts` int UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Eliminarea datelor din tabel `chat_reactions`
--

INSERT INTO `chat_reactions` (`message_id`, `user_id`, `emoji`, `ts`) VALUES
(67, 7, '❤️', 1763749563),
(67, 7, '👍', 1763749556),
(68, 7, '👍', 1763749541),
(69, 7, '❤️', 1763748642),
(69, 7, '😂', 1763748644),
(70, 7, '❤️', 1763748627),
(70, 7, '😂', 1763748611),
(71, 7, '❤️', 1763748436),
(71, 7, '👍', 1763748491),
(72, 7, '❤️', 1763748637),
(72, 7, '🔥', 1763748639),
(120, 8, '👍', 1763817288),
(149, 7, '👍', 1765134548),
(158, 7, '👍', 1763849775),
(162, 8, '👍', 1763854045),
(165, 8, '👍', 1763854247),
(173, 7, '👍', 1764261684),
(174, 7, '👍', 1764412604),
(177, 7, '❤️', 1765134758),
(177, 7, '👍', 1765134757),
(178, 7, '👍', 1765136434),
(186, 7, '❤️', 1765134442),
(186, 7, '👍', 1765134440),
(200, 7, '👍', 1765154398);
